app/Controllers/AlokasiRealisasi.php

    public function alokasi_realisasi()
    {

        $rtka = $this->RTKAlokasiModel->findAll();
        $rtkr = $this->RTKRealisasiModel->findAll();
        $anakpetak = $this->AnakPetakModel->findAll();
        $hwd = $this->DesaHwdModel->findAll();
---
SELECT *
FROM `umt_anakpetak`
SELECT *
FROM `desahwd`