app/Controllers/Dashboard.php

SELECT `apl`, `jpp`, `jati`, `jati_campur`, `mahoni`, `jagung`, `sawah`, `tebu`, `semak`, `sungai`
FROM `pl_detail`
SELECT *
FROM `umt_anakpetak`
---
    public function index()
    {

        $db1 = \Config\Database::connect();
        $chart = $db1->table('pl_detail');
        $chart->select('jagung, jalan, jati, jati_campur_semak, jpp, mahoni, makam, permukiman, sawah, semak, sungai, tebu');
        $chartquery = $chart->get();

        $chart1 = $chartquery->getResult();

        $db2 = \Config\Database::connect();
        $pie = $db2->table('pl');
        $pie->select(' apl, persen_apl, ht, persen_ht, jalan, persen_jln, permukiman, persen_pmk, pertanian_lk, persen_plk, sawah, persen_sawah, semak, persen_semak, sungai, persen_sungai');
        $piequery = $pie->get();

        $pie1 = $piequery->getResult();

        $db3 = \Config\Database::connect();
        $umt = $db3->table('umt');
        $umt->select('*');
        $umtquery = $umt->get();
        $umtcount = $umtquery->getResultArray();
        $jumlahumt = count($umtcount);

        $db4 = \Config\Database::connect();
        $anakpetak = $db4->table('umt_anakpetak');
        $anakpetak->select('*');
        $anakpetakquery = $anakpetak->get();

SELECT *
FROM `desa`
---
        $desa = \Config\Database::connect();
        $desa = $desa->table('desa');
        $desa->select('*');
        $desaquery = $desa->get();

SELECT *
FROM `lembagadesa`
---
        $lemdes = \Config\Database::connect();
        $lemdes = $lemdes->table('lembagadesa');
        $lemdes->select('*');
        $lemdesquery = $lemdes->get();

SELECT *
FROM `desahwd`
---
        $hwd = \Config\Database::connect();
        $hwd = $hwd->table('desahwd');
        $hwd->select('*');
        $hwdquery = $hwd->get();

SELECT *
FROM `users`
---
        $user = \Config\Database::connect();
        $user = $user->table('users');
        $user->select('*');
        $userquery = $user->get();

SELECT `role`
FROM `users`
WHERE `users`.`role` = 'admin'
---
        $admin = $admin->table('users');
        $admin->select('role');
        $admin->where('users.role', 'admin');
        $adminquery = $admin->get();

SELECT `active`
FROM `users`
WHERE `users`.`active` = '1'
---
        $active = $active->table('users');
        $active->select('active');
        $active->where('users.active', '1');
        $activequery = $active->get();

SELECT *
FROM `renstra`
---
        $renstra = \Config\Database::connect();
        $renstra = $renstra->table('renstra');
        $renstra->select('*');
        $renstraquery = $renstra->get();

SELECT *
FROM `renstratujuan`
---
        $renstratujuan = \Config\Database::connect();
        $renstratujuan = $renstratujuan->table('renstratujuan');
        $renstratujuan->select('*');
        $renstratujuanquery = $renstratujuan->get();

SELECT *
FROM `renstratarget`
---
        $renstratarget = \Config\Database::connect();
        $renstratarget = $renstratarget->table('renstratarget');
        $renstratarget->select('*');
        $renstratargetquery = $renstratarget->get();

SELECT *
FROM `rttahunankegalokasi`
---
        $alokasi = \Config\Database::connect();
        $alokasi = $alokasi->table('rttahunankegalokasi');
        $alokasi->select('*');
        $alokasiquery = $alokasi->get();

SELECT *
FROM `rttahunankegrealisasi`
---
        $realisasi = \Config\Database::connect();
        $realisasi = $realisasi->table('rttahunankegrealisasi');
        $realisasi->select('*');
        $realisasiquery = $realisasi->get();