app/Controllers/Hwd.php

SELECT *
FROM `desahwd`
SELECT *
FROM `desa`
SELECT *
FROM `andil`
SELECT *
FROM `umt_anakpetak`
---
    public function hwd()
    {

        $desahwd = $this->DesaHwdModel->findAll();
        $hwdanakpetak = $this->HwdAnakPetakModel->findAll();
        $desa = $this->DesaModel->findAll();
        $andil = $this->AndilModel->findAll();
        $lemdes = $this->LemdesModel->findAll();
        $anakpetak = $this->AnakPetakModel->findAll();