app/Controllers/RencanaStrategis.php

SELECT *
FROM `renstra`
SELECT *
FROM `renstratujuan`
SELECT *
FROM `renstratarget`
---
    public function rencana_strategis()
    {

        $renstra = $this->RenstraModel->findAll();
        $renstratujuan = $this->RenstraTujuanModel->findAll();
        $renstratarget = $this->RenstraTargetModel->findAll();