app/Controllers/RencanaTahunan.php

SELECT *
FROM `rencanatahunan`
SELECT *
FROM `renstra`
SELECT *
FROM `renstratujuan`
SELECT *
FROM `renstratarget`
---
    public function rencana_tahunan()
    {

        $rt = $this->RencanaTahunanModel->findAll();
        $rttujuan = $this->RTTujuanModel->findAll();
        $rttarget = $this->RTTargetModel->findAll();
        $renstra = $this->RenstraModel->findAll();
        $renstratujuan = $this->RenstraTujuanModel->findAll();
        $renstratarget = $this->RenstraTargetModel->findAll();