app/Controllers/SosekbudDesa.php

SELECT *
FROM `desa`
---
    public function sosekbud_desa()
    {

        $desa = $this->DesaModel->findAll();