app/Controllers/UserAlokasiRealisasi.php

SELECT *
FROM `umt_anakpetak`
SELECT *
FROM `desahwd`
---
    public function index()
    {

        $rtka = $this->RTKAlokasiModel->findAll();
        $rtkr = $this->RTKRealisasiModel->findAll();
        $anakpetak = $this->AnakPetakModel->findAll();
        $hwd = $this->DesaHwdModel->findAll();