app/Controllers/UserStrukturUmt.php

    public function index()
    {

        $anakpetak = $this->AnakPetakModel->findAll();
        $umt = $this->UmtModel->findAll();
        $tnmcupet = $this->TanamanAnakPetakModel->findAll();
        $zonlmu = $this->ZonasiLmuModel->findAll();
---
SELECT *
FROM `umt_anakpetak`
SELECT *
FROM `zonasi_lmu`