app/Controllers/UserTanamanUmt.php

SELECT *
FROM `umt_anakpetak`
SELECT *
FROM `zonasi_lmu`
---
    public function index()
    {

        $anakpetak = $this->AnakPetakModel->findAll();
        $umt = $this->UmtModel->findAll();
        $tnmanakpetak = $this->TanamanAnakPetakModel->findAll();
        $zonlmu = $this->ZonasiLmuModel->findAll();